{
    "highlights": "Here are the key features of the provided code:\n\n1. **Asynchronous Task**: The code defines a Celery shared task named `remove_document_from_index_task`, which runs asynchronously in the background to remove a document from the index.\n\n2. **Database and Cache Interaction**: The code interacts with the database (using `db.session`) to fetch the document and its segments. It also interacts with Redis (using `redis_client`) to manage an indexing cache key.\n\n3. **Index Processor**: The code uses the `IndexProcessorFactory` to initialize an index processor specific to the document's form. This processor is then used to clean the index for the document's segments.\n\n4. **Error Handling**: The code includes robust error handling, catching and logging any exceptions that may occur during the task execution. If the document is not archived, it is re-enabled in the database.\n\n5. **Logging and Timing**: The code uses logging extensively to provide detailed information about the task execution, including the start and end times, and the document ID being processed.\n\nThe key thing to look for in this code is the overall structure and flow of the asynchronous task, which includes fetching the document from the database, interacting with the index processor, and managing the indexing cache. The error handling and logging mechanisms are also important to ensure the task can be monitored and debugged effectively.",
    "overall_summary": "This codebase seems to be a Celery task that removes a document from an index. Here's a summary of the code:\n\n1. **remove_document_from_index_task**: This is a Celery shared task that is responsible for removing a document from the index. It takes a `document_id` as an argument.\n\n2. The task first retrieves the document from the database using the `Document` model. If the document is not found, it raises a `NotFound` exception.\n\n3. If the `indexing_status` of the document is not \"completed\", the task simply returns without doing anything.\n\n4. It then retrieves the dataset associated with the document. If the document has no dataset, it raises an exception.\n\n5. The task then initializes an `IndexProcessor` using the `IndexProcessorFactory` and the document's `doc_form` attribute.\n\n6. It retrieves all the `DocumentSegment` objects associated with the document and gets the `index_node_id` values for each segment.\n\n7. If there are any `index_node_id` values, the task calls the `clean` method of the `IndexProcessor` with the dataset and the `index_node_id` values as arguments. This is likely where the actual removal of the document from the index happens.\n\n8. If any exceptions occur during the process, the task logs the error and sets the `enabled` flag of the document to `True` (in case it was disabled due to the error).\n\n9. Finally, the task deletes the `indexing_cache_key` from the Redis client.\n\nOverall, this codebase provides a way to asynchronously remove a document from an index, handling errors and updating the document's status accordingly.",
    "pseudocode": "```python\n# Define a function to remove a document from the index\ndef remove_document_from_index(document_id):\n    # Log the start of the process\n    log_info(f\"Start removing document segments from index: {document_id}\")\n    start_time = get_current_time()\n\n    # Fetch the document from the database\n    document = get_document_by_id(document_id)\n    if not document:\n        # Raise an exception if the document is not found\n        raise NotFound(\"Document not found\")\n\n    # Check if the document has been indexed\n    if document.indexing_status != \"completed\":\n        # If not, return without doing anything\n        return\n\n    # Get the cache key for the document's indexing status\n    indexing_cache_key = f\"document_{document.id}_indexing\"\n\n    try:\n        # Get the dataset associated with the document\n        dataset = document.dataset\n        if not dataset:\n            # Raise an exception if the document has no dataset\n            raise Exception(\"Document has no dataset\")\n\n        # Get the appropriate index processor for the document's format\n        index_processor = get_index_processor_for_document_format(document.doc_form)\n\n        # Fetch all the segments associated with the document\n        segments = get_document_segments_by_document_id(document.id)\n        index_node_ids = [segment.index_node_id for segment in segments]\n\n        # If there are any index node IDs, clean them from the index\n        if index_node_ids:\n            try:\n                index_processor.clean(dataset, index_node_ids)\n            except Exception:\n                # Log an exception if cleaning the index fails\n                log_exception(f\"Clean dataset {dataset.id} from index failed\")\n\n        # Log the completion of the process\n        end_time = get_current_time()\n        log_info(f\"Document removed from index: {document.id} | Latency: {end_time - start_time}\")\n    except Exception:\n        # Log an exception if removing the document from the index fails\n        log_exception(\"Remove document from index failed\")\n        if not document.archived:\n            # If the document is not archived, re-enable it\n            document.enabled = True\n            save_document(document)\n    finally:\n        # Delete the indexing cache key\n        delete_redis_key(indexing_cache_key)\n\n# Define a Celery task to remove a document from the index asynchronously\n@shared_task(queue='dataset')\ndef remove_document_from_index_task(document_id):\n    \"\"\"\n    Async Remove document from index\n    :param document_id: document id\n\n    Usage: remove_document_from_index.delay(document_id)\n    \"\"\"\n    remove_document_from_index(document_id)\n```\n\nExplanation:\n1. The `remove_document_from_index` function is the main logic for removing a document from the index.\n2. It first logs the start of the process and gets the current time.\n3. It then fetches the document from the database, and if the document is not found, it raises a `NotFound` exception.\n4. If the document has not been indexed, it returns without doing anything.\n5. It then gets the cache key for the document's indexing status.\n6. Inside a try-except block, it gets the dataset associated with the document, and if the document has no dataset, it raises an exception.\n7. It then gets the appropriate index processor for the document's format and fetches all the segments associated with the document.\n8. If there are any index node IDs, it cleans them from the index using the index processor.\n9. If any exceptions occur during the process, it logs the exception and re-enables the document if it's not archived.\n10. Finally, it deletes the indexing cache key.\n11. The `remove_document_from_index_task` is a Celery task that calls the `remove_document_from_index` function asynchronously.",
    "import_relationships": "Imports found:\nimport logging\nimport time\nimport click\nfrom celery import shared_task\nfrom werkzeug.exceptions import NotFound\nfrom core.rag.index_processor.index_processor_factory import IndexProcessorFactory\nfrom extensions.ext_database import db\nfrom extensions.ext_redis import redis_client\nfrom models.dataset import Document, DocumentSegment"
}