{
    "highlights": "Here are the key features of the provided code:\n\n1. **Asynchronous Task**: The code defines an asynchronous task using the `@shared_task` decorator from the Celery library. This allows the task to be executed in the background, independent of the main application.\n\n2. **Document Recovery**: The primary purpose of the code is to recover the indexing process for a specific document. The `recover_document_indexing_task` function takes the `dataset_id` and `document_id` as parameters and attempts to resume the indexing process for the given document.\n\n3. **Database Interaction**: The code interacts with the database using the `db.session.query(Document)` method to fetch the document based on the provided `document_id` and `dataset_id`.\n\n4. **Indexing Runner**: The code utilizes the `IndexingRunner` class to handle the indexing process for the document. Depending on the current indexing status of the document, the appropriate method (`run`, `run_in_splitting_status`, or `run_in_indexing_status`) is called.\n\n5. **Error Handling**: The code includes exception handling to handle specific scenarios, such as when the document is paused (`DocumentIsPausedException`) or when any other exception occurs.\n\nThe key feature of this code is the ability to recover the indexing process for a specific document, which can be useful in scenarios where the indexing process has been interrupted or paused for some reason.",
    "overall_summary": "This Python file, `recover_document_indexing_task.py`, contains a single Celery task function named `recover_document_indexing_task`. This task is responsible for recovering the indexing process for a specific document in a dataset.\n\nHere's a breakdown of the codebase:\n\n1. **Imports**:\n   - The file imports necessary modules and classes, such as `logging`, `time`, `click`, `celery`, `werkzeug.exceptions`, and various classes from the project's own modules.\n\n2. **recover_document_indexing_task**:\n   - This function is a Celery shared task, which means it can be called asynchronously by other parts of the application.\n   - The task takes two parameters: `dataset_id` and `document_id`, which are used to retrieve the document from the database.\n   - The function logs the start of the task and the document ID being processed.\n   - It then retrieves the document from the database using the provided `dataset_id` and `document_id`.\n   - If the document is not found, the function raises a `NotFound` exception.\n   - Based on the current indexing status of the document, the function creates an instance of the `IndexingRunner` class and calls the appropriate method to continue the indexing process.\n   - The function logs the time it took to process the document.\n   - If a `DocumentIsPausedException` is raised, the function logs a yellow message. If any other exception occurs, the function simply passes.\n\nIn summary, this codebase provides a Celery task that can be used to recover the indexing process for a specific document in a dataset. The task retrieves the document from the database, checks its current indexing status, and then calls the appropriate method of the `IndexingRunner` class to continue the indexing process.",
    "pseudocode": "Sure, here's the high-level pythonic pseudocode for the `recover_document_indexing_task` function:\n\n```python\n# Define a Celery task to be executed asynchronously\n@shared_task(queue='dataset')\ndef recover_document_indexing_task(dataset_id: str, document_id: str):\n    \"\"\"\n    Asynchronously recover a document's indexing process.\n\n    Args:\n        dataset_id (str): The ID of the dataset the document belongs to.\n        document_id (str): The ID of the document to be recovered.\n    \"\"\"\n    # Log the start of the task and record the start time\n    logging.info(f\"Recover document: {document_id}\")\n    start_time = time.perf_counter()\n\n    # Fetch the document from the database\n    document = fetch_document(dataset_id, document_id)\n\n    # If the document is not found, raise a NotFound exception\n    if not document:\n        raise NotFound(\"Document not found\")\n\n    try:\n        # Create an IndexingRunner instance\n        indexing_runner = IndexingRunner()\n\n        # Determine the appropriate indexing step based on the document's status\n        if document.indexing_status in [\"waiting\", \"parsing\", \"cleaning\"]:\n            indexing_runner.run([document])\n        elif document.indexing_status == \"splitting\":\n            indexing_runner.run_in_splitting_status(document)\n        elif document.indexing_status == \"indexing\":\n            indexing_runner.run_in_indexing_status(document)\n\n        # Log the completion of the task and the processing time\n        end_time = time.perf_counter()\n        logging.info(f\"Processed document: {document.id} | Latency: {end_time - start_time}\")\n    except DocumentIsPausedException as ex:\n        # Log the exception if the document is paused\n        logging.info(click.style(str(ex), fg='yellow'))\n    except Exception:\n        # Log any other exceptions that may occur\n        pass\n```\n\nHere's a breakdown of the high-level pseudocode:\n\n1. The function is defined as a Celery task, which allows it to be executed asynchronously.\n2. The function takes two arguments: `dataset_id` and `document_id`, which are used to identify the document to be recovered.\n3. The function logs the start of the task and records the start time.\n4. The function fetches the document from the database using the provided `dataset_id` and `document_id`.\n5. If the document is not found, the function raises a `NotFound` exception.\n6. The function creates an `IndexingRunner` instance, which is responsible for managing the document indexing process.\n7. Based on the document's current indexing status, the function calls the appropriate method on the `IndexingRunner` instance to resume the indexing process.\n8. The function logs the completion of the task and the total processing time.\n9. If a `DocumentIsPausedException` is raised, the function logs the exception.\n10. If any other exception is raised, the function logs the exception.\n\nThe key aspects of this pseudocode are:\n- Asynchronous task execution using Celery\n- Fetching the document from the database\n- Handling different document indexing statuses\n- Logging the task progress and any exceptions\n\nThis high-level pseudocode provides a clear overview of the functionality and structure of the `recover_document_indexing_task` function, without delving into the implementation details.",
    "import_relationships": "Imports found:\nimport logging\nimport time\nimport click\nfrom celery import shared_task\nfrom werkzeug.exceptions import NotFound\nfrom core.indexing_runner import DocumentIsPausedException, IndexingRunner\nfrom extensions.ext_database import db\nfrom models.dataset import Document"
}